### 📖 Terraform Plan (infra/resources/prod) - success
<details>
<summary>Show Plan</summary>

```hcl
  # azurerm_key_vault_secret.session_st_connection_string will be created
  + resource "azurerm_key_vault_secret" "session_st_connection_string" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-auth-main-rg-01/providers/Microsoft.KeyVault/vaults/io-p-itn-auth-kv-01"
      + name                    = "session-st-connection-string"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = {
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Auth&Identity"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-auth-n-identity-domain/tree/main/infra/resources/prod"
        }
      + value                   = (sensitive value)
      + value_wo                = (write-only attribute)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.function_profile_async.azurerm_linux_function_app.this will be updated in-place
  ~ resource "azurerm_linux_function_app" "this" {
      ~ app_settings                                   = {
          - "APPINSIGHTS_SAMPLING_PERCENTAGE"                                                                  = "5"
          - "AZURE_STORAGE_CONNECTION_STRING"                                                                  = "@Microsoft.KeyVault(SecretUri=https://io-p-itn-auth-kv-01.vault.azure.net/secrets/citizen-auth-common-connection-string)"
          - "AzureFunctionsJobHost__extensions__serviceBus__maxConcurrentSessions"                             = "100"
          - "AzureFunctionsJobHost__extensions__serviceBus__sessionIdleTimeout"                                = "00:00:05"
          - "AzureFunctionsJobHost__logging__applicationInsights__samplingSettings__initialSamplingPercentage" = "5"
          - "AzureFunctionsJobHost__logging__applicationInsights__samplingSettings__maxSamplingPercentage"     = "5"
          - "AzureFunctionsJobHost__logging__applicationInsights__samplingSettings__minSamplingPercentage"     = "5"
          - "AzureWebJobs.ExpiredSessionAdvisor.Disabled"                                                      = "0"
          - "AzureWebJobs.ExpiredSessionsDiscoverer.Disabled"                                                  = "0"
          - "AzureWebJobs.MigrateServicePreferenceFromLegacy.Disabled"                                         = "0"
          - "AzureWebJobs.OnProfileUpdate.Disabled"                                                            = "0"
          - "AzureWebJobs.SessionNotificationEventsProcessor.Disabled"                                         = "0"
          - "AzureWebJobs.SessionNotificationsInitRecovery.Disabled"                                           = "0"
          - "AzureWebJobs.StoreSpidLogs.Disabled"                                                              = "0"
          - "CITIZEN_AUTH_COSMOSDB_CONNECTION_STRING"                                                          = "@Microsoft.KeyVault(SecretUri=https://io-p-itn-auth-kv-01.vault.azure.net/secrets/cosmos-auth-connection-string)"
          - "CITIZEN_AUTH_COSMOSDB_NAME"                                                                       = "citizen-auth"
          - "COSMOSDB_CONNECTION_STRING"                                                                       = "@Microsoft.KeyVault(SecretUri=https://io-p-kv-common.vault.azure.net/secrets/cosmos-api-connection-string)"
          - "COSMOSDB_NAME"                                                                                    = "db"
          - "EXPIRED_SESSION_ADVISOR_QUEUE"                                                                    = "expired-user-sessions"
          - "EXPIRED_SESSION_CTA_URL"                                                                          = "https://continua.io.pagopa.it?utm_source=email&utm_medium=email&utm_campaign=session_expired&pt=121080668&ct=email_session_expired&mt=8"
          - "EXPIRED_SESSION_SCANNER_CHUNK_SIZE"                                                               = "100"
          - "EXPIRED_SESSION_SCANNER_TIMEOUT_MULTIPLIER"                                                       = "7"
          - "FETCH_KEEPALIVE_ENABLED"                                                                          = "true"
          - "FETCH_KEEPALIVE_FREE_SOCKET_TIMEOUT"                                                              = "30000"
          - "FETCH_KEEPALIVE_MAX_FREE_SOCKETS"                                                                 = "10"
          - "FETCH_KEEPALIVE_MAX_SOCKETS"                                                                      = "40"
          - "FETCH_KEEPALIVE_SOCKET_ACTIVE_TTL"                                                                = "110000"
          - "FETCH_KEEPALIVE_TIMEOUT"                                                                          = "60000"
          - "FF_DRY_RUN"                                                                                       = "true"
          - "FUNCTIONS_WORKER_PROCESS_COUNT"                                                                   = "2"
          - "FUNCTION_PROFILE_API_KEY"                                                                         = "@Microsoft.KeyVault(SecretUri=https://io-p-itn-auth-kv-01.vault.azure.net/secrets/profile-async-function-profile-key)"
          - "FUNCTION_PROFILE_BASE_URL"                                                                        = "https://io-p-itn-auth-profile-func-02.azurewebsites.net"
          - "IOPSTAPP_STORAGE_CONNECTION_STRING"                                                               = "@Microsoft.KeyVault(SecretUri=https://io-p-itn-auth-kv-01.vault.azure.net/secrets/iopstapp-connection-string)"
          - "IOPSTLOGS_STORAGE_CONNECTION_STRING"                                                              = "@Microsoft.KeyVault(SecretUri=https://io-p-itn-auth-kv-01.vault.azure.net/secrets/iopstlogs-connection-string)"
          - "MAILUP_SECRET"                                                                                    = "@Microsoft.KeyVault(SecretUri=https://io-p-itn-auth-kv-01.vault.azure.net/secrets/mailup-secret)"
          - "MAILUP_USERNAME"                                                                                  = "@Microsoft.KeyVault(SecretUri=https://io-p-itn-auth-kv-01.vault.azure.net/secrets/mailup-username)"
          - "MAIL_FROM"                                                                                        = "IO - l'app dei servizi pubblici <no-reply@io.italia.it>"
          - "MIGRATE_SERVICES_PREFERENCES_PROFILE_QUEUE_NAME"                                                  = "profile-migrate-services-preferences-from-legacy"
          - "NODE_ENV"                                                                                         = "production"
          - "ON_PROFILE_UPDATE_LEASES_PREFIX"                                                                  = "OnProfileUpdateLeasesPrefix-001"
          - "PLATFORM_SERVICEBUS_CONNECTION__fullyQualifiedNamespace"                                          = "io-p-itn-platform-sbns-01.servicebus.windows.net"
          - "PROFILE_EMAIL_STORAGE_TABLE_NAME"                                                                 = "profileEmails"
          - "SERVICEBUS_AUTH_SESSION_TOPIC"                                                                    = "io-auth-sessions-topic"
          - "SERVICEBUS_NOTIFICATION_EVENT_SUBSCRIPTION"                                                       = "io-session-notifications-sub"
          - "SERVICEBUS_NOTIFICATION_EVENT_SUBSCRIPTION_MAX_DELIVERY_COUNT"                                    = "10"
          - "SESSION_MANAGER_INTERNAL_API_KEY"                                                                 = "@Microsoft.KeyVault(SecretUri=https://io-p-itn-auth-kv-01.vault.azure.net/secrets/profile-async-session-manager-internal-key)"
          - "SESSION_MANAGER_INTERNAL_BASE_URL"                                                                = "https://io-p-weu-auth-sm-int-func-01.azurewebsites.net"
          - "SESSION_NOTIFICATIONS_CONTAINER_NAME"                                                             = "session-notifications"
          - "SESSION_NOTIFICATIONS_INIT_RECOVERY_QUEUE"                                                        = "session-notifications-init-recovery"
          - "SLOT_TASK_HUBNAME"                                                                                = "ProductionTaskHub"
          - "SPID_LOGS_PUBLIC_KEY"                                                                             = (sensitive value)
          - "WEBSITE_ADD_SITENAME_BINDINGS_IN_APPHOST_CONFIG"                                                  = "1"
          - "WEBSITE_DNS_SERVER"                                                                               = "168.63.129.16"
          - "WEBSITE_RUN_FROM_PACKAGE"                                                                         = "1"
          - "WEBSITE_SWAP_WARMUP_PING_PATH"                                                                    = "/info"
          - "WEBSITE_SWAP_WARMUP_PING_STATUSES"                                                                = "200,204"
          - "WEBSITE_WARMUP_PATH"                                                                              = "/info"
        } -> (known after apply)
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-auth-main-rg-01/providers/Microsoft.Web/sites/io-p-itn-auth-profas-func-02"
        name                                           = "io-p-itn-auth-profas-func-02"
        tags                                           = {
            "CostCenter"                                     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"                                      = "Terraform"
            "Environment"                                    = "Prod"
            "ManagementTeam"                                 = "IO Auth&Identity"
            "ModuleName"                                     = "azure_function_app"
            "ModuleSource"                                   = "DX"
            "ModuleVersion"                                  = "1.0.1"
            "Owner"                                          = "IO"
            "Source"                                         = "https://github.com/pagopa/io-auth-n-identity-domain/tree/main/infra/resources/prod"
            "hidden-link: /app-insights-conn-string"         = "InstrumentationKey=ab45103a-cb4f-474b-933f-d802ed1082d5;IngestionEndpoint=https://westeurope-3.in.applicationinsights.azure.com/;LiveEndpoint=https://westeurope.livediagnostics.monitor.azure.com/;ApplicationId=2a5ffa17-99f9-4d9b-a253-18dba6759d94"
            "hidden-link: /app-insights-instrumentation-key" = "ab45103a-cb4f-474b-933f-d802ed1082d5"
            "hidden-link: /app-insights-resource-id"         = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/microsoft.insights/components/io-p-ai-common"
        }
        # (33 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.function_profile_async.azurerm_linux_function_app_slot.this[0] will be updated in-place
  ~ resource "azurerm_linux_function_app_slot" "this" {
      ~ app_settings                                   = {
          - "APPINSIGHTS_SAMPLING_PERCENTAGE"                                                                  = "100"
          - "AZURE_STORAGE_CONNECTION_STRING"                                                                  = (sensitive value)
          - "AzureFunctionsJobHost__extensions__serviceBus__maxConcurrentSessions"                             = "100"
          - "AzureFunctionsJobHost__extensions__serviceBus__sessionIdleTimeout"                                = "00:00:05"
          - "AzureFunctionsJobHost__logging__applicationInsights__samplingSettings__initialSamplingPercentage" = "100"
          - "AzureFunctionsJobHost__logging__applicationInsights__samplingSettings__maxSamplingPercentage"     = "100"
          - "AzureFunctionsJobHost__logging__applicationInsights__samplingSettings__minSamplingPercentage"     = "100"
          - "AzureFunctionsWebHost__hostid"                                                                    = "staging"
          - "AzureWebJobs.ExpiredSessionAdvisor.Disabled"                                                      = "1"
          - "AzureWebJobs.ExpiredSessionsDiscoverer.Disabled"                                                  = "1"
          - "AzureWebJobs.MigrateServicePreferenceFromLegacy.Disabled"                                         = "1"
          - "AzureWebJobs.OnProfileUpdate.Disabled"                                                            = "1"
          - "AzureWebJobs.SessionNotificationEventsProcessor.Disabled"                                         = "1"
          - "AzureWebJobs.SessionNotificationsInitRecovery.Disabled"                                           = "1"
          - "AzureWebJobs.StoreSpidLogs.Disabled"                                                              = "1"
          - "CITIZEN_AUTH_COSMOSDB_CONNECTION_STRING"                                                          = (sensitive value)
          - "CITIZEN_AUTH_COSMOSDB_NAME"                                                                       = "citizen-auth"
          - "COSMOSDB_CONNECTION_STRING"                                                                       = (sensitive value)
          - "COSMOSDB_NAME"                                                                                    = "db"
          - "EXPIRED_SESSION_ADVISOR_QUEUE"                                                                    = "expired-user-sessions"
          - "EXPIRED_SESSION_CTA_URL"                                                                          = "https://continua.io.pagopa.it?utm_source=email&utm_medium=email&utm_campaign=session_expired&pt=121080668&ct=email_session_expired&mt=8"
          - "EXPIRED_SESSION_SCANNER_CHUNK_SIZE"                                                               = "100"
          - "EXPIRED_SESSION_SCANNER_TIMEOUT_MULTIPLIER"                                                       = "7"
          - "FETCH_KEEPALIVE_ENABLED"                                                                          = "true"
          - "FETCH_KEEPALIVE_FREE_SOCKET_TIMEOUT"                                                              = "30000"
          - "FETCH_KEEPALIVE_MAX_FREE_SOCKETS"                                                                 = "10"
          - "FETCH_KEEPALIVE_MAX_SOCKETS"                                                                      = "40"
          - "FETCH_KEEPALIVE_SOCKET_ACTIVE_TTL"                                                                = "110000"
          - "FETCH_KEEPALIVE_TIMEOUT"                                                                          = "60000"
          - "FF_DRY_RUN"                                                                                       = "true"
          - "FUNCTIONS_WORKER_PROCESS_COUNT"                                                                   = "2"
          - "FUNCTION_PROFILE_API_KEY"                                                                         = (sensitive value)
          - "FUNCTION_PROFILE_BASE_URL"                                                                        = "https://io-p-itn-auth-profile-func-02.azurewebsites.net"
          - "IOPSTAPP_STORAGE_CONNECTION_STRING"                                                               = (sensitive value)
          - "IOPSTLOGS_STORAGE_CONNECTION_STRING"                                                              = (sensitive value)
          - "MAILUP_SECRET"                                                                                    = (sensitive value)
          - "MAILUP_USERNAME"                                                                                  = (sensitive value)
          - "MAIL_FROM"                                                                                        = "IO - l'app dei servizi pubblici <no-reply@io.italia.it>"
          - "MIGRATE_SERVICES_PREFERENCES_PROFILE_QUEUE_NAME"                                                  = "profile-migrate-services-preferences-from-legacy"
          - "NODE_ENV"                                                                                         = "production"
          - "ON_PROFILE_UPDATE_LEASES_PREFIX"                                                                  = "OnProfileUpdateLeasesPrefix-001"
          - "PLATFORM_SERVICEBUS_CONNECTION__fullyQualifiedNamespace"                                          = "io-p-itn-platform-sbns-01.servicebus.windows.net"
          - "PROFILE_EMAIL_STORAGE_TABLE_NAME"                                                                 = "profileEmails"
          - "SERVICEBUS_AUTH_SESSION_TOPIC"                                                                    = "io-auth-sessions-topic"
          - "SERVICEBUS_NOTIFICATION_EVENT_SUBSCRIPTION"                                                       = "io-session-notifications-sub"
          - "SERVICEBUS_NOTIFICATION_EVENT_SUBSCRIPTION_MAX_DELIVERY_COUNT"                                    = "10"
          - "SESSION_MANAGER_INTERNAL_API_KEY"                                                                 = (sensitive value)
          - "SESSION_MANAGER_INTERNAL_BASE_URL"                                                                = "https://io-p-weu-auth-sm-int-func-01.azurewebsites.net"
          - "SESSION_NOTIFICATIONS_CONTAINER_NAME"                                                             = "session-notifications"
          - "SESSION_NOTIFICATIONS_INIT_RECOVERY_QUEUE"                                                        = "session-notifications-init-recovery"
          - "SLOT_TASK_HUBNAME"                                                                                = "StagingTaskHub"
          - "SPID_LOGS_PUBLIC_KEY"                                                                             = (sensitive value)
          - "WEBSITE_ADD_SITENAME_BINDINGS_IN_APPHOST_CONFIG"                                                  = "1"
          - "WEBSITE_DNS_SERVER"                                                                               = "168.63.129.16"
          - "WEBSITE_RUN_FROM_PACKAGE"                                                                         = "1"
          - "WEBSITE_SWAP_WARMUP_PING_PATH"                                                                    = "/info"
          - "WEBSITE_SWAP_WARMUP_PING_STATUSES"                                                                = "200,204"
          - "WEBSITE_WARMUP_PATH"                                                                              = "/info"
        } -> (known after apply)
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-auth-main-rg-01/providers/Microsoft.Web/sites/io-p-itn-auth-profas-func-02/slots/staging"
        name                                           = "staging"
        tags                                           = {
            "CostCenter"                                     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"                                      = "Terraform"
            "Environment"                                    = "Prod"
            "ManagementTeam"                                 = "IO Auth&Identity"
            "ModuleName"                                     = "azure_function_app"
            "ModuleSource"                                   = "DX"
            "ModuleVersion"                                  = "1.0.1"
            "Owner"                                          = "IO"
            "Source"                                         = "https://github.com/pagopa/io-auth-n-identity-domain/tree/main/infra/resources/prod"
            "hidden-link: /app-insights-conn-string"         = "InstrumentationKey=ab45103a-cb4f-474b-933f-d802ed1082d5;IngestionEndpoint=https://westeurope-3.in.applicationinsights.azure.com/;LiveEndpoint=https://westeurope.livediagnostics.monitor.azure.com/;ApplicationId=2a5ffa17-99f9-4d9b-a253-18dba6759d94"
            "hidden-link: /app-insights-instrumentation-key" = "ab45103a-cb4f-474b-933f-d802ed1082d5"
            "hidden-link: /app-insights-resource-id"         = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/microsoft.insights/components/io-p-ai-common"
        }
        # (31 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.storage_account_services.azurerm_storage_queue.queues["expired-user-sessions-poison-01"] will be created
  + resource "azurerm_storage_queue" "queues" {
      + id                   = (known after apply)
      + metadata             = {
          + "costcenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "createdby"      = "Terraform"
          + "environment"    = "Prod"
          + "managementteam" = "IO Auth&Identity"
          + "owner"          = "IO"
          + "source"         = "https://github.com/pagopa/io-auth-n-identity-domain/tree/main/infra/resources/prod"
        }
      + name                 = "expired-user-sessions-poison-01"
      + resource_manager_id  = (known after apply)
      + storage_account_name = "iopitnauthsessionst01"
    }

Plan: 2 to add, 2 to change, 0 to destroy.
```

</details>
